## Обзорное занятие по работе с библиотекой Pandas

In [2]:
import pandas as pd

## Seriers

In [11]:
s = pd.Series(data = [1, 2, 3, 4, 5], index = "one two three four five".split())
print(s[2])
print()
print(s["two"])

3

2

## DataFrame

In [34]:
df = pd.DataFrame({"name": "Иванов Петров Сидоров".split(), 
                  "age": [25, 41, 18], "Married":["Yes", "No", "Yes"]}, 
                 index = [1, 2, 3])

In [31]:
df

      name  age Married
1   Иванов   25     Yes
2   Петров   41      No
3  Сидоров   18     Yes

In [37]:
# извлекаем весь столбец
df["Married"]

1    Yes
2     No
3    Yes
Name: Married, dtype: object

In [42]:
df.age

1    25
2    41
3    18
Name: age, dtype: int64

In [43]:
df.age[2]

41

In [52]:
# Извлекаем отдельный элемент, способ 1 (используем значения индексов и названия столбцов)
df["age"][1]

25

In [53]:
df.loc[1]["age"]

25

In [54]:
# Извлекаем отдельный элемент, способ 2 (используем номера строк и столбцов)
df.iloc[0][1]

25

In [56]:
# Объединяем два способа - #1
df["age"].iloc[0]

25

In [57]:
# Объединяем два способа  - #2
df.age.iloc[0]

25

In [66]:
df.name.iloc[1]

'Петров'

# Датасет Титаника

In [79]:
df = pd.read_csv("train.csv")
df.head(15)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S

In [78]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [73]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [74]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [75]:
df.describe().T # T похоже на транспонирование. Просто на 90% поменять угол обзора. 
                # применимо везде

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

In [81]:
df[["Age", "Survived", "Pclass"]].head() # вывести на экран опредленные столбцы

    Age  Survived  Pclass
0  22.0         0       3
1  38.0         1       1
2  26.0         1       3
3  35.0         1       1
4  35.0         0       3

## Фильтрация данных

In [88]:
# Выведем данные только о пассажирах 1 класса, которые погибли (первые 10 строк):
df[(df["Pclass"] == 1) & (df["Survived"] == 0)].head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C
34,35,0,1,"Meyer, Mr. Edgar Joseph",male,28.0,1,0,PC 17604,82.1708,NaN,C
35,36,0,1,"Holverson, Mr. Alexander Oskar",male,42.0,1,0,113789,52.0000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
62,63,0,1,"Harris, Mr. Henry Birkhardt",male,45.0,1,0,36973,83.4750,C83,S
64,65,0,1,"Stewart, Mr. Albert A",male,NaN,0,0,PC 17605,27.7208,NaN,C
83,84,0,1,"Carrau, Mr. Francisco M",male,28.0,0,0,113059,47.1000,NaN,S
92,93,0,1,"Chaffee, Mr. Herbert Fuller",male,46.0,1,0,W.E.P. 5734,61.1750,E31,S

Считаем дополнительные статистические показатели для определённого столбца:

In [109]:
# Найдем минимальную стоимость билета:
df.Fare.min()
# df["Fare"].min()

0.0

In [114]:
# Найдем минимальную стоимость билета для взрослого пассажира:
df[df["Age"] >= 18].Fare.min()
# df[df["Age"] >= 18]["Fare"].min()

0.0

In [115]:
df[(df.Fare == 0) & (df.Age >= 18)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
179,180,0,3,"Leonard, Mr. Lionel",male,36.0,0,0,LINE,0.0,NaN,S
263,264,0,1,"Harrison, Mr. William",male,40.0,0,0,112059,0.0,B94,S
271,272,1,3,"Tornquist, Mr. William Henry",male,25.0,0,0,LINE,0.0,NaN,S
302,303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0,NaN,S
597,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0,NaN,S
806,807,0,1,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0,A36,S
822,823,0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0,NaN,S

In [99]:
df[(df["Age"] >= 18) & (df["Fare"])].min() # конкертный человек

PassengerId                      1
Survived                         0
Pclass                           1
Name           Abbing, Mr. Anthony
Sex                         female
Age                             18
SibSp                            0
Parch                            0
Ticket                      110152
Fare                        4.0125
dtype: object

In [121]:
# Найдем возраст самого страшего пассажира, путешествовавшего по бесплатному билету
df[df["Fare"] == 0].Age.max()

49.0

In [123]:
# Найдем минимальную стоимость билета для детей:
df[df["Age"] < 18].Fare.min()

7.0542

In [127]:
# Найдем минимальную стоимость платных билетов для взрослых:
df[(df["Age"] >= 18) & (df["Fare"] > 0)].min()

PassengerId                      1
Survived                         0
Pclass                           1
Name           Abbing, Mr. Anthony
Sex                         female
Age                             18
SibSp                            0
Parch                            0
Ticket                      110152
Fare                        4.0125
dtype: object

In [129]:
# Найдем среднюю стоимость билета в первом классе
df[df["Pclass"] == 1].Fare.mean()

84.15468749999992

In [132]:
# Найдем среднюю стоимость билета в первом классе без учета бесплатных билетов
df[(df["Pclass"] == 1) & (df["Fare"] != 0)].mean()

PassengerId    456.687204
Survived         0.644550
Pclass           1.000000
Age             38.220874
SibSp            0.426540
Parch            0.364929
Fare            86.148874
dtype: float64

## Эксперименты с группировками

### value_counts()

In [133]:
# статистика кто выжил, а кто нет. 
df.Survived.value_counts() # метод value_counts только к Series!

0    549
1    342
Name: Survived, dtype: int64

In [146]:
# Посчитаем статистику выживших и погибших среди мужчин
# df[df["Sex"] == "male"].Survived.value_counts()
df[df["Sex"] == "male"]["Survived"].value_counts()

0    468
1    109
Name: Survived, dtype: int64

In [147]:
# Посчитаем статистику выживших и погибших среди женщин
df[df["Sex"] == "female"]["Survived"].value_counts()

1    233
0     81
Name: Survived, dtype: int64

In [149]:
# Организуем вывод обобщенных данных о погибших и выживших среди мужчин и женщин
for sex in df["Sex"].unique():
    if sex == "male":
        print("Данные о мужчинах")
    else:
        print("Данные о женщинах")
    print(df[df["Sex"] == sex]["Survived"].value_counts())

Данные о мужчинах
0    468
1    109
Name: Survived, dtype: int64
Данные о женщинах
1    233
0     81
Name: Survived, dtype: int64

In [156]:
import timeit

In [161]:
# Решение №1
# Посчитаем статистику выживших и погибших среди пассажиров 1 класса 
for survived in df["Survived"].unique():
    for pclass in df["Pclass"]:
        if pclass == 1:
            pass
        else:
            break
    print(df[df["Pclass"] == survived]["Survived"].value_counts())
timeit.timeit()

Series([], Name: Survived, dtype: int64)
1    136
0     80
Name: Survived, dtype: int64

0.011325130999466637

In [159]:
# Решение №2
df[df["Pclass"] == 1].Survived.value_counts()
timeit.timeit()

0.011422849998780293

In [162]:
# Решение №3
df[df["Pclass"] == 1]["Survived"].value_counts()
timeit.timeit()

0.02359344000069541

In [179]:
# Посчитаем обобщенные данные по классам и полу
for pclass in sorted(df["Pclass"].unique()):
    print(pclass, "класс")
    
    for sex in df["Sex"].unique():
        if sex == "male":
            print("Данные о мужчинах")
        else:
            print("Данные о женщинах")
        print(df[(df.Sex == sex) & (df.Pclass == pclass)].Survived.value_counts())

1 класс
Данные о мужчинах
0    77
1    45
Name: Survived, dtype: int64
Данные о женщинах
1    91
0     3
Name: Survived, dtype: int64
2 класс
Данные о мужчинах
0    91
1    17
Name: Survived, dtype: int64
Данные о женщинах
1    70
0     6
Name: Survived, dtype: int64
3 класс
Данные о мужчинах
0    300
1     47
Name: Survived, dtype: int64
Данные о женщинах
1    72
0    72
Name: Survived, dtype: int64

## groupby()

In [180]:
# Считаем средний возраст выживших и погибших
# (сгруппируем пассажиров по столбцу 'Survived' и посчитаем средний возраст в каждой группе)

df.groupby(by = "Survived" )["Age"].mean()

Survived
0    30.626179
1    28.343690
Name: Age, dtype: float64

In [186]:
# Считаем средний возраст выживших и погибших по классам
# (сгруппируем пассажиров по столбцам 'Survived'и 'Pclass' и посчитаем средний возраст в каждой группе)

df.groupby(by = ["Survived", "Pclass"])["Age"].mean()

Survived  Pclass
0         1         43.695312
          2         33.544444
          3         26.555556
1         1         35.368197
          2         25.901566
          3         20.646118
Name: Age, dtype: float64

In [195]:
# Считаем количество выживших и погибших в зависимости от класса и пола
df.groupby(by = ["Pclass", "Sex"]).Survived.value_counts()

Pclass  Sex     Survived
1       female  1            91
                0             3
        male    0            77
                1            45
2       female  1            70
                0             6
        male    0            91
                1            17
3       female  0            72
                1            72
        male    0           300
                1            47
Name: Survived, dtype: int64

In [198]:
df.groupby(by = ["Pclass", "Sex", "Survived"]).Name.count()

Pclass  Sex     Survived
1       female  0             3
                1            91
        male    0            77
                1            45
2       female  0             6
                1            70
        male    0            91
                1            17
3       female  0            72
                1            72
        male    0           300
                1            47
Name: Name, dtype: int64

In [200]:
# Считаем минимальную, среднюю и максимальную стоимость билетов по классам (исключая бесплатные билеты)

df[df.Fare != 0].groupby(by = "Pclass")["Fare"].agg(["min", "max", "mean"])

            min       max       mean
Pclass
1        5.0000  512.3292  86.148874
2       10.5000   73.5000  21.358661
3        4.0125   69.5500  13.787875

In [215]:
# Считаем минимальные и максимальные возраст и сумму оплаты по классам 
# для выживших и погибших пассажиров
df[df.Fare != 0].groupby(by = ["Pclass", "Survived"])["Fare", "Age"].agg(["min", "max"])

                    Fare              Age
                     min       max    min   max
Pclass Survived
1      0          5.0000  263.0000   2.00  71.0
       1         25.9292  512.3292   0.92  80.0
2      0         10.5000   73.5000  16.00  70.0
       1         10.5000   65.0000   0.67  62.0
3      0          4.0125   69.5500   1.00  74.0
       1          6.9750   56.4958   0.42  63.0

In [223]:
df[(df.Survived == 0) & (df.Pclass == 3)].groupby(by = ["Pclass", "Fare"]).agg(["max"])

               PassengerId Survived                                     Name  \
                       max      max                                      max
Pclass Fare
3      0.0000          598        0                      Leonard, Mr. Lionel
       4.0125          379        0                      Betros, Mr. Tannous
       6.2375          327        0                Nysveen, Mr. Johan Hansen
       6.4375          844        0               Lemberopolous, Mr. Peter L
       6.4500          819        0         Holm, Mr. John Fredrik Alexander
...                    ...      ...                                      ...
       34.3750         737        0  Ford, Mrs. Edward (Margaret Ann Watson)
       39.6875         825        0   Panula, Mrs. Juha (Maria Emilia Ojala)
       46.9000         684        0  Goodwin, Mrs. Frederick (Augusta Tyler)
       56.4958         827        0                            Ling, Mr. Lee
       69.5500         864        0                 Sage, Mr. George John Jr

                 Sex   Age SibSp Parch      Ticket Embarked
                 max   max   max   max         max      max
Pclass Fare
3      0.0000   male  49.0     0     0        LINE        S
       4.0125   male  20.0     0     0        2648        C
       6.2375   male  61.0     0     0      345364        S
       6.4375   male  34.5     0     0        2683        C
       6.4500   male  43.0     0     0      C 7075        S
...              ...   ...   ...   ...         ...      ...
       34.3750  male  48.0     2     3  W./C. 6608        S
       39.6875  male  41.0     4     5     3101295        S
       46.9000  male  43.0     5     6     CA 2144        S
       56.4958  male  28.0     0     0        1601        S
       69.5500  male   NaN     8     2    CA. 2343        S

[98 rows x 9 columns]

## pivot_table()

In [227]:
# Считаем средний возраст выживших и погибших пассажиров по классам
df.pivot_table(values = 'Age', index = 'Pclass', columns = 'Survived', aggfunc = 'mean')

Survived          0          1
Pclass
1         43.695312  35.368197
2         33.544444  25.901566
3         26.555556  20.646118

In [228]:
# Считаем минимальную, максимальную и среднюю стоимость билета 
# для выживших и погибших пассажиров в зависимости от класса
df.pivot_table(values = "Fare", index = "Pclass", columns = "Survived", aggfunc = ["max", "min", "mean"])

             max            min                mean
Survived       0         1    0        1          0          1
Pclass
1         263.00  512.3292  0.0  25.9292  64.684008  95.608029
2          73.50   65.0000  0.0  10.5000  19.412328  22.055700
3          69.55   56.4958  0.0   0.0000  13.669364  13.694887

Извлекаем из полученных данных информацию о конкретной категории пассажиров

In [231]:
# Помещаем сгруппированные данные в отдельный датафрейм:
test = df.pivot_table(values = "Fare", index = "Pclass", columns = "Survived", aggfunc = ["max", "min", "mean"])

In [232]:
# Извлекаем среднюю стоимость билета для погибших мужчин - пассажиров 1 класса:
test["mean"][0][1]

64.68400750000002

In [233]:
# Считаем среднее количесто братьев, сестер и супругов ('SibSp'), 
# которые путешествовали с выжившими и погибшими пассажирами разных классов

df.pivot_table(values = "SibSp", index = "Pclass", columns = "Survived", aggfunc = ["mean"])

              mean
Survived         0         1
Pclass
1         0.287500  0.492647
2         0.319588  0.494253
3         0.672043  0.436975

### Слияние таблиц

In [ ]:
df2 = pd.read_csv('sexes.csv')

In [234]:
df2

NameError: name 'df2' is not defined

In [ ]:
df(head)

In [ ]:
df3 = df.merge(df2, on = "Sex").tail(10)